# ボックスのサイズ。これは固定値で20
BOX_SIZE = 40
# BOX_SIZEの倍数にします
WINDOW_WIDTH = 400
# 高さは自由に設定していいです
WINDOW_HEIGHT = 600

# ブロックの形
BLOCKS = (
    ("chara01.png", (0, 0), (1, 0), (0, 1), (1, 1)),  # 四角
    ("chara02.png", (0, 0), (1, 0), (2, 0), (3, 0)),  # 直線
    ("enemy03.png", (2, 0), (0, 1), (1, 1), (2, 1)),  # 右L字
    ("enemy04.png", (0, 0), (0, 1), (1, 1), (2, 1)),  # 左L字
    ("enemy05.png", (0, 1), (1, 1), (1, 0), (2, 0)),  # 右カギ形
    ("enemy06.png", (0, 0), (1, 0), (1, 1), (2, 1)),  # 左カギ形
    ("img704_10.png", (1, 0), (0, 1), (1, 1), (2, 1)),  # 土形
)

# ブロックの画像を格納する辞書
BLOCK_IMAGES = {}
